
    
    

//Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе
let a1 = [1, 2, 3];
let b1 = [4, 5, 6];
console.log();(a1.concat(b1));

//Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1]
let a2 = [1, 2, 3];
console.log(a2.reverse());
    
    //Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6
let a3 = [1, 2, 3];
a3.push(4, 5, 6);
console.log(a3);

//Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6
 let a4 = [1, 2, 3];
 a4.unshift(4, 5, 6);
console.log(a4);

//Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
let arr1 = ['js', 'css', 'jq'];
console.log(arr1.shift());
//Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент
console.log(arr1.pop());


//Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3]
let arr2 = [1, 2, 3, 4, 5];
console.log(arr2.slice(0,3));


//Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5]
console.log(arr2.slice(3));

//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5]
let arr3 = [1, 2, 3, 4, 5];
arr3.splice(1, 2);
console.log(arr3);

//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4]

let arr4 = [1, 2, 3, 4, 5];
console.log(arr4.splice(1,3));

    //Дан массив [3, 4, 1, 2, 7]. Отсортируйте его
    let arr5 = [3, 4, 1, 2, 7];
    console.log(arr5.sort());
